{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "dab2e617",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "import json\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "from dotenv import load_dotenv\n",
    "from langchain_community.document_loaders import TextLoader\n",
    "from langchain_core.documents import Document\n",
    "from langchain_neo4j import Neo4jVector\n",
    "from langchain_text_splitters import RecursiveCharacterTextSplitter\n",
    "from langchain_google_genai import GoogleGenerativeAIEmbeddings\n",
    "from langchain_classic.chains import RetrievalQA\n",
    "from langchain.chat_models import init_chat_model\n",
    "import textwrap\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "a24630f5",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE') or 'neo4j'\n",
    "os.environ[\"GOOGLE_API_KEY\"] = os.getenv(\"GOOGLE_API_KEY\")\n",
    "\n",
    "VECTOR_INDEX_NAME = 'brd_chunks'\n",
    "VECTOR_NODE_LABEL = 'Chunk'\n",
    "VECTOR_SOURCE_PROPERTY = 'text'\n",
    "VECTOR_EMBEDDING_PROPERTY = 'textEmbedding'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "d2b0287b",
   "metadata": {},
   "outputs": [],
   "source": [
    "GOOGLE_API_KEY = os.getenv(\"GOOGLE_API_KEY\")\n",
    "GOOGLE_ENDPOINT_URL = \"https://generativelanguage.googleapis.com/v1beta2/models/text-embedding-3-small:embedContent\"\n",
    "# \"https://ai.google.dev/api/embeddings#method:-models.embedcontent\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "d1938580",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "84afaea0\n"
     ]
    }
   ],
   "source": [
    "print(NEO4J_DATABASE)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d9ca1b93",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "brd_file_name = \"C:\\\\Users\\\\HP\\\\OneDrive\\\\Desktop\\\\Dinesh\\\\TCS\\\\Apple\\\\Tasks\\\\projects\\\\graphrag\\\\parsed_brd.json\"\n",
    "brd_file_as_object = json.load(open(brd_file_name))\n",
    "type(brd_file_as_object)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "3fb57b3c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Features <class 'str'>\n",
      "Modules <class 'str'>\n",
      "UserStories <class 'str'>\n",
      "Issues <class 'str'>\n"
     ]
    }
   ],
   "source": [
    "for k,v in brd_file_as_object.items():\n",
    "    print(k, type(v))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "84e63834",
   "metadata": {},
   "outputs": [],
   "source": [
    "feature_text = brd_file_as_object['Features']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "8f1e121b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'This BRD outlines the business objectives, stakeholders, functional and non-functional requirements, scope, constraints, and success criteria for React ChatBotify.\\n2. Business Objectives\\n2.1 Primary Objectives\\nProvide a reusable chatbot component for React applications.\\nEnable developers to easily configure chatbot conversations.\\nSupport enterprise-level customization (themes, plugins, settings, styles).\\nMaintain backward compatibility across React versions (16–19).\\nEnsure strong extensibility via hooks and event-driven architecture.\\n2.2 Secondary Objectives\\nEnable analytics integration.\\nSupport AI-driven chatbot logic.\\nAllow plugin ecosystem growth.\\nSupport mobile-first responsive behavior.\\nImprove developer experience (DX).\\n3. Project Scope\\n3.1 In Scope\\nReact chatbot component library\\nConversation flow management\\nSettings and style customization\\nEvent-driven architecture\\nPlugin framework\\nTheme support\\nAudio & voice services\\nMobile support optimization\\nUnit, integration, and compatibility testing\\nCI/CD pipeline validation\\n3.2 Out of Scope\\nHosting infrastructure\\nBackend AI implementation\\nNatural language processing engine\\nEnterprise SaaS hosting platform\\nProprietary analytics backend\\n4. Stakeholders\\n5. Current State Analysis\\nReact ChatBotify evolved from a simple chatbot library (v1) into a feature-rich v2 architecture with:\\nModular folder structure\\nSeparation of Settings and Styles\\nCustom Events system\\nInternal and External Hooks\\nThemes repository\\nExperimental Plugin architecture\\nImproved Mobile handling\\nAutomated testing (Jest, Cypress, CI compatibility)\\n6. Functional Requirements\\n6.1 Chatbot Core\\nFR1: System must render a chatbot UI component.\\nFR2: System must allow configurable conversation flows.\\nFR3: System must support block-based conversation structure.\\nFR4: System must manage user inputs and bot responses.\\nFR5: System must support conversation paths logic.\\n6.2 Conversation Management\\nFR6: Developers must define conversation blocks via JSON/TS objects.\\nFR7: Each block must support attributes (messages, options, validation, etc.).\\nFR8: System must support conditional navigation between blocks.\\nFR9: System must support custom input validation logic.\\n6.3 Settings & Styles\\nFR10: System must accept a settings prop for functional configurations.\\nFR11: System must accept a styles prop for UI customization.\\nFR12: Default settings must be loaded if user does not supply configuration.\\nFR13: User settings must merge with default settings safely.\\n6.4 Events System\\nFR14: System must dispatch lifecycle events (e.g., message inject, input submit).\\nFR15: Developers must subscribe to events externally.\\nFR16: Events must allow integration with analytics, logging, or APIs.\\nExample:\\nRcbPostMessageInjectEvent\\nRcbUserSubmitInputEvent\\n6.5 Hooks System\\nFR17: System must expose external hooks for advanced control.\\nFR18: Internal hooks must remain encapsulated.\\nFR19: External hooks must act as filtering layer over internal logic.\\n6.6 Audio & Voice\\nFR20: System must support audio playback of messages.\\nFR21: System must support voice input via microphone.\\nFR22: Audio and voice must be toggleable via hooks.\\n6.7 Themes\\nFR23: System must support theme-based styling.\\nFR24: Themes must be externally maintainable.\\nFR25: Themes must integrate seamlessly with styles prop.\\n6.8 Plugins\\nFR26: System must support plugin injection.\\nFR27: Plugins must hook into events and hooks.\\nFR28: Plugins must remain loosely coupled.\\n6.9 Mobile Support\\nFR29: Chatbot must render full-screen mode on mobile.\\nFR30: System must handle mobile keyboard resizing behavior.\\nFR31: Resize listeners must adjust chatbot dimensions dynamically.\\n6.10 Testing\\nFR32: Unit testing via Jest.\\nFR33: Integration testing via Cypress.\\nFR34: Compatibility testing across React 16–19.\\nFR35: CI/CD must validate builds before release.\\n7. Non-Functional Requirements\\n7.1 Performance\\nNFR1: Avoid unnecessary re-renders using useMemo and useCallback.\\nNFR2: Optimize message rendering.\\nNFR3: Minimize bundle size.\\n7.2 Scalability\\nNFR4: Architecture must support plugin ecosystem growth.\\nNFR5: Conversation engine must scale to large flows.\\n7.3 Usability\\nNFR6: API must be intuitive.\\nNFR7: Documentation must clearly explain concepts (Conversations, Settings, Styles, Themes).\\n7.4 Maintainability\\nNFR8: Clear folder structure separation.\\nNFR9: Code documentation required for major components.\\nNFR10: TODO comments must track technical debt.\\n7.5 Compatibility\\nNFR11: Must support React 16, 17, 18, 19.\\nNFR12: Must work across modern browsers.\\nNFR13: Mobile browser compatibility (iOS Safari, Android Chrome).'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "feature_text"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "04474003",
   "metadata": {},
   "outputs": [],
   "source": [
    "text_splitter = RecursiveCharacterTextSplitter(\n",
    "    chunk_size = 1000,\n",
    "    chunk_overlap  = 100,\n",
    "    length_function = len,\n",
    "    is_separator_regex = False,\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "ff02a7c5",
   "metadata": {},
   "outputs": [],
   "source": [
    "feature_text_chunks = text_splitter.split_text(feature_text)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "8cd66089",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "list"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(feature_text_chunks)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "b6be4a48",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(feature_text_chunks)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "bc6057c2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'This BRD outlines the business objectives, stakeholders, functional and non-functional requirements, scope, constraints, and success criteria for React ChatBotify.\\n2. Business Objectives\\n2.1 Primary Objectives\\nProvide a reusable chatbot component for React applications.\\nEnable developers to easily configure chatbot conversations.\\nSupport enterprise-level customization (themes, plugins, settings, styles).\\nMaintain backward compatibility across React versions (16–19).\\nEnsure strong extensibility via hooks and event-driven architecture.\\n2.2 Secondary Objectives\\nEnable analytics integration.\\nSupport AI-driven chatbot logic.\\nAllow plugin ecosystem growth.\\nSupport mobile-first responsive behavior.\\nImprove developer experience (DX).\\n3. Project Scope\\n3.1 In Scope\\nReact chatbot component library\\nConversation flow management\\nSettings and style customization\\nEvent-driven architecture\\nPlugin framework\\nTheme support\\nAudio & voice services\\nMobile support optimization'"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "feature_text_chunks[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "4cae420c",
   "metadata": {},
   "outputs": [],
   "source": [
    "def split_brd_data_from_file(file):\n",
    "    chunks_with_metadata = [] # use this to accumlate chunk records\n",
    "    file_as_object = json.load(open(file)) # open the json file\n",
    "    for item in ['Features','Modules','UserStories','Issues']: # pull these keys from the json\n",
    "        print(f'Processing {item} from {file}') \n",
    "        item_text = file_as_object[item] # grab the text of the item\n",
    "        item_text_chunks = text_splitter.split_text(item_text) # split the text into chunks\n",
    "        chunk_seq_id = 0\n",
    "        for chunk in item_text_chunks[:10]: # only take the first 10 chunks\n",
    "            form_id = 'brd_document' # extract form id from file name\n",
    "            # finally, construct a record with metadata and the chunk text\n",
    "            chunks_with_metadata.append({\n",
    "                'text': chunk, \n",
    "                # metadata from looping...\n",
    "                'brdItem': item,\n",
    "                'chunkSeqId': chunk_seq_id,\n",
    "                # constructed metadata...\n",
    "                'formId': f'{form_id}', # pulled from the filename\n",
    "                'chunkId': f'{form_id}-{item}-chunk{chunk_seq_id:04d}',\n",
    "                # metadata from file...\n",
    "                # 'names': file_as_object['names'],\n",
    "                # 'cik': file_as_object['cik'],\n",
    "                # 'cusip6': file_as_object['cusip6'],\n",
    "                # 'source': file_as_object['source'],\n",
    "            })\n",
    "            chunk_seq_id += 1\n",
    "        print(f'\\tSplit into {chunk_seq_id} chunks')\n",
    "    return chunks_with_metadata"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "5feae3c0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Processing Features from C:\\Users\\HP\\OneDrive\\Desktop\\Dinesh\\TCS\\Apple\\Tasks\\projects\\graphrag\\parsed_brd.json\n",
      "\tSplit into 5 chunks\n",
      "Processing Modules from C:\\Users\\HP\\OneDrive\\Desktop\\Dinesh\\TCS\\Apple\\Tasks\\projects\\graphrag\\parsed_brd.json\n",
      "\tSplit into 1 chunks\n",
      "Processing UserStories from C:\\Users\\HP\\OneDrive\\Desktop\\Dinesh\\TCS\\Apple\\Tasks\\projects\\graphrag\\parsed_brd.json\n",
      "\tSplit into 3 chunks\n",
      "Processing Issues from C:\\Users\\HP\\OneDrive\\Desktop\\Dinesh\\TCS\\Apple\\Tasks\\projects\\graphrag\\parsed_brd.json\n",
      "\tSplit into 1 chunks\n"
     ]
    }
   ],
   "source": [
    "brd_file_chunks = split_brd_data_from_file(brd_file_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "c90ef186",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\HP\\AppData\\Local\\Temp\\ipykernel_27988\\336443517.py:1: LangChainDeprecationWarning: The class `Neo4jGraph` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the `langchain-neo4j package and should be used instead. To use it run `pip install -U `langchain-neo4j` and import as `from `langchain_neo4j import Neo4jGraph``.\n",
      "  kg = Neo4jGraph(\n"
     ]
    }
   ],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI, username=NEO4J_USERNAME, password=NEO4J_PASSWORD, database=NEO4J_DATABASE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "a8ed82b4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\"\"\"\n",
    "CREATE CONSTRAINT unique_chunk IF NOT EXISTS \n",
    "    FOR (c:Chunk) REQUIRE c.chunkId IS UNIQUE\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "f47e0766",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 1,\n",
       "  'name': 'index_1b9dcc97',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'LOOKUP',\n",
       "  'entityType': 'RELATIONSHIP',\n",
       "  'labelsOrTypes': None,\n",
       "  'properties': None,\n",
       "  'indexProvider': 'token-lookup-1.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': None,\n",
       "  'readCount': 0},\n",
       " {'id': 0,\n",
       "  'name': 'index_460996c0',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'LOOKUP',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': None,\n",
       "  'properties': None,\n",
       "  'indexProvider': 'token-lookup-1.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': None,\n",
       "  'readCount': 0},\n",
       " {'id': 2,\n",
       "  'name': 'unique_chunk',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'RANGE',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': ['Chunk'],\n",
       "  'properties': ['chunkId'],\n",
       "  'indexProvider': 'range-1.0',\n",
       "  'owningConstraint': 'unique_chunk',\n",
       "  'lastRead': None,\n",
       "  'readCount': 0}]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\"SHOW INDEXES\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "712710f3",
   "metadata": {},
   "outputs": [],
   "source": [
    "merge_chunk_node_query = \"\"\"\n",
    "MERGE(mergedChunk:Chunk {chunkId: $chunkParam.chunkId})\n",
    "    ON CREATE SET \n",
    "        mergedChunk.brdItem = $chunkParam.brdItem, \n",
    "        mergedChunk.chunkSeqId = $chunkParam.chunkSeqId, \n",
    "        mergedChunk.text = $chunkParam.text\n",
    "RETURN mergedChunk\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "33e0d309",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Creating `:Chunk` node for chunk ID brd_document-Features-chunk0000\n",
      "Creating `:Chunk` node for chunk ID brd_document-Features-chunk0001\n",
      "Creating `:Chunk` node for chunk ID brd_document-Features-chunk0002\n",
      "Creating `:Chunk` node for chunk ID brd_document-Features-chunk0003\n",
      "Creating `:Chunk` node for chunk ID brd_document-Features-chunk0004\n",
      "Creating `:Chunk` node for chunk ID brd_document-Modules-chunk0000\n",
      "Creating `:Chunk` node for chunk ID brd_document-UserStories-chunk0000\n",
      "Creating `:Chunk` node for chunk ID brd_document-UserStories-chunk0001\n",
      "Creating `:Chunk` node for chunk ID brd_document-UserStories-chunk0002\n",
      "Creating `:Chunk` node for chunk ID brd_document-Issues-chunk0000\n",
      "Created 10 nodes\n"
     ]
    }
   ],
   "source": [
    "node_count = 0\n",
    "for chunk in brd_file_chunks:\n",
    "    print(f\"Creating `:Chunk` node for chunk ID {chunk['chunkId']}\")\n",
    "    kg.query(merge_chunk_node_query, \n",
    "            params={\n",
    "                'chunkParam': chunk\n",
    "            })\n",
    "    node_count += 1\n",
    "print(f\"Created {node_count} nodes\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "74f79119",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'nodeCount': 10}]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\"\"\"\n",
    "         MATCH (n)\n",
    "         RETURN count(n) as nodeCount\n",
    "         \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "4a3b6727",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\"\"\"\n",
    "         CREATE VECTOR INDEX `brd_chunks` IF NOT EXISTS\n",
    "          FOR (c:Chunk) ON (c.textEmbedding) \n",
    "          OPTIONS { indexConfig: {\n",
    "            `vector.dimensions`: 1536,\n",
    "            `vector.similarity_function`: 'cosine'    \n",
    "         }}\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "01a0ac61",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 4,\n",
       "  'name': 'brd_chunks',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'VECTOR',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': ['Chunk'],\n",
       "  'properties': ['textEmbedding'],\n",
       "  'indexProvider': 'vector-3.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': None,\n",
       "  'readCount': 0},\n",
       " {'id': 1,\n",
       "  'name': 'index_1b9dcc97',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'LOOKUP',\n",
       "  'entityType': 'RELATIONSHIP',\n",
       "  'labelsOrTypes': None,\n",
       "  'properties': None,\n",
       "  'indexProvider': 'token-lookup-1.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': None,\n",
       "  'readCount': 0},\n",
       " {'id': 0,\n",
       "  'name': 'index_460996c0',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'LOOKUP',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': None,\n",
       "  'properties': None,\n",
       "  'indexProvider': 'token-lookup-1.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': neo4j.time.DateTime(2026, 3, 5, 9, 21, 4, 807000000, tzinfo=<UTC>),\n",
       "  'readCount': 19},\n",
       " {'id': 2,\n",
       "  'name': 'unique_chunk',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'RANGE',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': ['Chunk'],\n",
       "  'properties': ['chunkId'],\n",
       "  'indexProvider': 'range-1.0',\n",
       "  'owningConstraint': 'unique_chunk',\n",
       "  'lastRead': neo4j.time.DateTime(2026, 3, 5, 8, 30, 0, 3000000, tzinfo=<UTC>),\n",
       "  'readCount': 20}]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "kg.query(\"SHOW INDEXES\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d50dea22",
   "metadata": {},
   "outputs": [],
   "source": [
    "embeddings = GoogleGenerativeAIEmbeddings(model=\"models/gemini-embedding-001\",output_dimensionality=1536)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d63ea1bb",
   "metadata": {},
   "outputs": [],
   "source": [
    "existing_graph = Neo4jVector.from_existing_graph(\n",
    "    # embedding=GoogleGenerativeAIEmbeddings(model=\"models/gemini-embedding-001\",output_dimensionality=1536),\n",
    "    embedding=embeddings,\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    node_label=VECTOR_NODE_LABEL,\n",
    "    text_node_properties=[VECTOR_SOURCE_PROPERTY],\n",
    "    embedding_node_property=VECTOR_EMBEDDING_PROPERTY,\n",
    "    \n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "74e0022b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# kg.query(\"\"\"\n",
    "#     MATCH (chunk:Chunk) WHERE chunk.textEmbedding IS NULL\n",
    "#     WITH chunk, genai.vector.encode(\n",
    "#       chunk.text, \n",
    "#       \"OpenAI\", \n",
    "#       {\n",
    "#         token: $googleApiKey, \n",
    "#         endpoint: $googleEndpoint\n",
    "#       }) AS vector\n",
    "#     CALL db.create.setNodeVectorProperty(chunk, \"textEmbedding\", vector)\n",
    "#     \"\"\", \n",
    "#     params={\"googleApiKey\":GOOGLE_API_KEY, \"googleEndpoint\": GOOGLE_ENDPOINT_URL} )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "e7976e12",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Chunk {chunkId: STRING, brdItem: STRING, chunkSeqId: INTEGER, text: STRING, textEmbedding: LIST}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "\n"
     ]
    }
   ],
   "source": [
    "kg.refresh_schema()\n",
    "print(kg.schema)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "e1d7c2ab",
   "metadata": {},
   "outputs": [],
   "source": [
    "result = existing_graph.similarity_search(\"what are the features of the product?\", k=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "073ae281",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'\\ntext: This BRD outlines the business objectives, stakeholders, functional and non-functional requirements, scope, constraints, and success criteria for React ChatBotify.\\n2. Business Objectives\\n2.1 Primary Objectives\\nProvide a reusable chatbot component for React applications.\\nEnable developers to easily configure chatbot conversations.\\nSupport enterprise-level customization (themes, plugins, settings, styles).\\nMaintain backward compatibility across React versions (16–19).\\nEnsure strong extensibility via hooks and event-driven architecture.\\n2.2 Secondary Objectives\\nEnable analytics integration.\\nSupport AI-driven chatbot logic.\\nAllow plugin ecosystem growth.\\nSupport mobile-first responsive behavior.\\nImprove developer experience (DX).\\n3. Project Scope\\n3.1 In Scope\\nReact chatbot component library\\nConversation flow management\\nSettings and style customization\\nEvent-driven architecture\\nPlugin framework\\nTheme support\\nAudio & voice services\\nMobile support optimization'"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result[0].page_content\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "b2ae87af",
   "metadata": {},
   "outputs": [],
   "source": [
    "# cypher = \"\"\"MATCH (chunk:Chunk)\n",
    "# SET chunk.formId = 'brd_document'\n",
    "# RETURN chunk;\n",
    "# \"\"\"\n",
    "# kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "117898dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (from_same_section:Chunk)\n",
    "  WHERE from_same_section.formId = $formIdParam\n",
    "    AND from_same_section.brdItem = $brdItemParam\n",
    "  WITH from_same_section\n",
    "    ORDER BY from_same_section.chunkSeqId ASC\n",
    "  WITH collect(from_same_section) as section_chunk_list\n",
    "    CALL apoc.nodes.link(\n",
    "        section_chunk_list, \n",
    "        \"NEXT\", \n",
    "        {avoidDuplicates: true}\n",
    "    )\n",
    "  RETURN size(section_chunk_list)\n",
    "\"\"\"\n",
    "for brdItemName in ['Features','Modules','UserStories','Issues']:\n",
    "  kg.query(cypher, params={'formIdParam':'brd_document', \n",
    "                           'brdItemParam': brdItemName})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "2fe9e83d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Chunk {chunkId: STRING, brdItem: STRING, chunkSeqId: INTEGER, text: STRING, textEmbedding: LIST, formId: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Chunk)-[:NEXT]->(:Chunk)\n"
     ]
    }
   ],
   "source": [
    "kg.refresh_schema()\n",
    "print(kg.schema)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "787729f9",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "[#FDEE]  _: <CONNECTION> error: Failed to read from defunct connection IPv4Address(('p-mt-3b814dd7cab7-1-0014.production-orch-0068.neo4j.io', 7687)) (ResolvedIPv6Address(('64:ff9b::227e:ab19', 7687, 0, 0))): OSError('No data')\n",
      "Transaction failed and will be retried in 1.1901983404287113s (Failed to read from defunct connection IPv4Address(('p-mt-3b814dd7cab7-1-0014.production-orch-0068.neo4j.io', 7687)) (ResolvedIPv6Address(('64:ff9b::227e:ab19', 7687, 0, 0))))\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'BRDInfo': {'formId': 'brd_document'}}]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (anyChunk:Chunk) \n",
    "  WITH anyChunk LIMIT 1\n",
    "  RETURN anyChunk {.formId } as BRDInfo\n",
    "\"\"\"\n",
    "form_info_list = kg.query(cypher)\n",
    "\n",
    "form_info_list\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "c8b38329",
   "metadata": {},
   "outputs": [],
   "source": [
    "brd_info = form_info_list[0]['BRDInfo']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "d2d0606f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "    MERGE (f:BRDInfo {formId: $BRDInfoParam.formId })\n",
    "      ON CREATE \n",
    "        SET f.names = 'BRD Document'\n",
    "\"\"\"\n",
    "\n",
    "kg.query(cypher, params={'BRDInfoParam': brd_info})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "94d1c66b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(newRelationship)': 10}]"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (c:Chunk), (f:BRDInfo)\n",
    "    WHERE c.formId = f.formId\n",
    "  MERGE (c)-[newRelationship:PART_OF]->(f)\n",
    "  RETURN count(newRelationship)\n",
    "\"\"\"\n",
    "\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "958ce195",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 4}]"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = \"\"\"\n",
    "  MATCH (first:Chunk), (f:BRDInfo)\n",
    "  WHERE first.formId = f.formId\n",
    "    AND first.chunkSeqId = 0\n",
    "  WITH first, f\n",
    "    MERGE (f)-[r:SECTION {BRDItem: first.brdItem}]->(first)\n",
    "  RETURN count(r)\n",
    "\"\"\"\n",
    "\n",
    "kg.query(cypher)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "7b1ce3fb",
   "metadata": {},
   "outputs": [],
   "source": [
    "retrieval_query_window = \"\"\"\n",
    "MATCH window=\n",
    "    (:Chunk)-[:NEXT*0..1]->(node)-[:NEXT*0..1]->(:Chunk)\n",
    "WITH node, score, window as longestWindow \n",
    "  ORDER BY length(window) DESC LIMIT 1\n",
    "WITH nodes(longestWindow) as chunkList, node, score\n",
    "  UNWIND chunkList as chunkRows\n",
    "WITH collect(chunkRows.text) as textList, node, score\n",
    "RETURN apoc.text.join(textList, \" \\n \") as text,\n",
    "    score,\n",
    "    node {.source} AS metadata\n",
    "\"\"\"\n",
    "vector_store_window = Neo4jVector.from_existing_index(\n",
    "    embedding=embeddings,\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE,\n",
    "    index_name=VECTOR_INDEX_NAME,\n",
    "    text_node_property=VECTOR_SOURCE_PROPERTY,\n",
    "    retrieval_query=retrieval_query_window, # NEW!!!\n",
    ")\n",
    "\n",
    "# Create a retriever from the vector store\n",
    "retriever_window = vector_store_window.as_retriever()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "f7cb4a1c",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Create a chatbot Question & Answer chain from the retriever\n",
    "chain_window = RetrievalQA.from_chain_type(\n",
    "    # ChatOpenAI(temperature=0), \n",
    "    ChatGoogleGenerativeAI(model=\"gemini-2.5-flash\", temperature=0),\n",
    "    chain_type=\"stuff\", \n",
    "    retriever=retriever_window\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "ba4c05cf",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `source` does not exist in database `84afaea0`. Verify that the spelling is correct.', position=<SummaryInputPosition line=12, column=12, offset=511>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 511, 'line': 12, 'column': 12}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: 'CALL db.index.vector.queryNodes($vector_index_name, $top_k * $effective_search_ratio, $query_vector) YIELD node, score WITH node, score LIMIT $top_k \\nMATCH window=\\n    (:Chunk)-[:NEXT*0..1]->(node)-[:NEXT*0..1]->(:Chunk)\\nWITH node, score, window as longestWindow \\n  ORDER BY length(window) DESC LIMIT 1\\nWITH nodes(longestWindow) as chunkList, node, score\\n  UNWIND chunkList as chunkRows\\nWITH collect(chunkRows.text) as textList, node, score\\nRETURN apoc.text.join(textList, \" \\n \") as text,\\n    score,\\n    node {.source} AS metadata\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Based on the provided requirements, the product features are:  **Core\n",
      "Chatbot Functionality:** *   Renders a chatbot UI component. *\n",
      "Manages user inputs and bot responses. *   Supports audio playback of\n",
      "messages. *   Supports voice input via microphone. *   Allows audio\n",
      "and voice features to be toggled.  **Conversation Flow & Logic:** *\n",
      "Allows configurable conversation flows. *   Supports a block-based\n",
      "conversation structure. *   Enables developers to define conversation\n",
      "blocks using JSON/TS objects. *   Each block supports attributes like\n",
      "messages, options, and validation. *   Supports conversation paths\n",
      "logic. *   Supports conditional navigation between blocks. *\n",
      "Supports custom input validation logic.  **Customization & Styling:**\n",
      "*   Accepts a `settings` prop for functional configurations. *\n",
      "Accepts a `styles` prop for UI customization. *   Loads default\n",
      "settings if no configuration is supplied, and safely merges user\n",
      "settings. *   Supports theme-based styling. *   Allows themes to be\n",
      "externally maintainable and integrate with the `styles` prop.\n",
      "**Extensibility & Integration:** *   Dispatches lifecycle events\n",
      "(e.g., message inject, input submit). *   Allows developers to\n",
      "subscribe to events externally for integration with analytics,\n",
      "logging, or APIs. *   Exposes external hooks for advanced control,\n",
      "acting as a filtering layer over internal logic. *   Supports plugin\n",
      "injection, allowing plugins to hook into events and hooks while\n",
      "remaining loosely coupled.  **Mobile Responsiveness:** *   Renders in\n",
      "full-screen mode on mobile. *   Handles mobile keyboard resizing\n",
      "behavior. *   Adjusts chatbot dimensions dynamically via resize\n",
      "listeners.\n"
     ]
    }
   ],
   "source": [
    "question = \"What are the features of the product?\"\n",
    "answer = chain_window(\n",
    "    {\"query\": question},\n",
    "    return_only_outputs=True,\n",
    ")\n",
    "print(textwrap.fill(answer['result']))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "81ef0471",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `source` does not exist in database `84afaea0`. Verify that the spelling is correct.', position=<SummaryInputPosition line=12, column=12, offset=511>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 511, 'line': 12, 'column': 12}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: 'CALL db.index.vector.queryNodes($vector_index_name, $top_k * $effective_search_ratio, $query_vector) YIELD node, score WITH node, score LIMIT $top_k \\nMATCH window=\\n    (:Chunk)-[:NEXT*0..1]->(node)-[:NEXT*0..1]->(:Chunk)\\nWITH node, score, window as longestWindow \\n  ORDER BY length(window) DESC LIMIT 1\\nWITH nodes(longestWindow) as chunkList, node, score\\n  UNWIND chunkList as chunkRows\\nWITH collect(chunkRows.text) as textList, node, score\\nRETURN apoc.text.join(textList, \" \\n \") as text,\\n    score,\\n    node {.source} AS metadata\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "React ChatBotify has evolved into a feature-rich v2 architecture with\n",
      "the following high-level components and design principles:  *\n",
      "**Modular folder structure:** Indicating a well-organized and scalable\n",
      "codebase. *   **Separation of Settings and Styles:** Clearly\n",
      "distinguishing functional configurations from UI customization. *\n",
      "**Custom Events system:** An event-driven architecture for dispatching\n",
      "and subscribing to lifecycle events. *   **Internal and External\n",
      "Hooks:** Providing extensibility and integration points. *   **Themes\n",
      "repository:** Supporting a modular approach to UI theming. *\n",
      "**Experimental Plugin architecture:** Enabling further extensibility\n",
      "and ecosystem growth.\n"
     ]
    }
   ],
   "source": [
    "question = \"What is the high level overview of the product architecture layer?\"\n",
    "answer = chain_window(\n",
    "    {\"query\": question},\n",
    "    return_only_outputs=True,\n",
    ")\n",
    "print(textwrap.fill(answer['result']))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "88ba16cd",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `source` does not exist in database `84afaea0`. Verify that the spelling is correct.', position=<SummaryInputPosition line=12, column=12, offset=511>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 511, 'line': 12, 'column': 12}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: 'CALL db.index.vector.queryNodes($vector_index_name, $top_k * $effective_search_ratio, $query_vector) YIELD node, score WITH node, score LIMIT $top_k \\nMATCH window=\\n    (:Chunk)-[:NEXT*0..1]->(node)-[:NEXT*0..1]->(:Chunk)\\nWITH node, score, window as longestWindow \\n  ORDER BY length(window) DESC LIMIT 1\\nWITH nodes(longestWindow) as chunkList, node, score\\n  UNWIND chunkList as chunkRows\\nWITH collect(chunkRows.text) as textList, node, score\\nRETURN apoc.text.join(textList, \" \\n \") as text,\\n    score,\\n    node {.source} AS metadata\\n'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Based on the provided functional requirements, here are the\n",
      "constraints:  *   **Technology/Tooling Constraints:**     *   Unit\n",
      "testing must be done via Jest (FR32).     *   Integration testing must\n",
      "be done via Cypress (FR33).     *   Compatibility testing is required\n",
      "across React versions 16–19 (FR34).     *   CI/CD must validate builds\n",
      "before release (FR35). *   **Design/Architectural Constraints:**     *\n",
      "Conversation blocks must be defined via JSON/TS objects (FR6).     *\n",
      "Internal hooks must remain encapsulated (FR18).     *   Plugins must\n",
      "remain loosely coupled (FR28).     *   Themes must be externally\n",
      "maintainable (FR24).     *   User settings must merge safely with\n",
      "default settings (FR13).     *   External hooks must act as a\n",
      "filtering layer over internal logic (FR19). *   **Development/API\n",
      "Constraints:**     *   Developers must define conversation blocks via\n",
      "JSON/TS objects (FR6).     *   Developers must subscribe to events\n",
      "externally (FR15).\n"
     ]
    }
   ],
   "source": [
    "question = \"What are the constraints?\"\n",
    "answer = chain_window(\n",
    "    {\"query\": question},\n",
    "    return_only_outputs=True,\n",
    ")\n",
    "print(textwrap.fill(answer['result']))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4450d55b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graphrag",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
